app/views/gossip/show_gossip.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
      <%= link_to "/author/#{@gossip.user.id}" do %>
        <%= @gossip.user.first_name %>