app/views/welcome/show_welcome.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
          <td>
            <%= @list_gossip[index_gossip].user.first_name %>