app/controllers/details_user_controller.rb

  def show_details_user
    @user = User.find_by(id: params["id_user"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]