app/controllers/gossip_controller.rb

  def show_gossip
    @gossip = Gossip.find_by(id: params["id_gossip"])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]