app/controllers/welcome_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def show_welcome
    @first_name = (params[:first_name].blank? == true || params[:first_name] == "") ? ("cher utilisateur") : (params[:first_name])
    @list_gossip = Gossip.all